examples/stokes_wave_2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.com
    \\  /    A nd           | Version:  2512
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            ehWaveVel;
        waveName        wave1;
    }

    outlet
    {
        type            ehWaveVel;
        waveName        wave1;
    }

    ground
    {
        type            ehWaveVel;
        waveName        wave1;
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    sides
    {
        type            empty;
    }
}
